Revit 2026 API

# CurveDistance Method

---

Returns the shortest distance from the specified point to this curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Distance(
	XYZ point
)
```
```vb
Public Function Distance (
	point As XYZ
) As Double
```
```cpp
public:
double Distance(
	XYZ^ point
)
```
```fsharp
member Distance :
        point : XYZ -> float
```

#### Parameters

point XYZ
    The specified point.

#### Return Value

DoubleThe real number equal to the shortest distance.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when failed to find the closest point on the curve. |

Returns the distance from the closest point on the curve to the specified point.

#### Reference

Curve Class

Autodesk.Revit.DB Namespace